In [15]:
# import the pandas library and aliasing as pd
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

### slice łącznie z 4 - by label

In [7]:
print(df.loc[0:4]) #by label

          A         B         C         D
0 -0.361084  0.249275 -0.931071  1.585738
1  0.567543  0.738718  2.212160 -2.130589
2 -0.680366  0.596854 -1.073641 -0.555807
3 -1.463872 -0.130571  0.733981 -1.447959
4  0.203810  0.463675  0.389133 -0.974736

### slice z wyłączeniem 4 - by index

In [8]:
print(df.iloc[0:4]) #by index

          A         B         C         D
0 -0.361084  0.249275 -0.931071  1.585738
1  0.567543  0.738718  2.212160 -2.130589
2 -0.680366  0.596854 -1.073641 -0.555807
3 -1.463872 -0.130571  0.733981 -1.447959

## range - działa z wyłączeniem zakresu_do
range(0,3):
0,1,2

In [9]:
print(df.loc[0]) # by label

A   -0.361084
B    0.249275
C   -0.931071
D    1.585738
Name: 0, dtype: float64

In [10]:
print(df.iloc[0]) # by index

A   -0.361084
B    0.249275
C   -0.931071
D    1.585738
Name: 0, dtype: float64

In [12]:
print(df.A[0])

0.49470699134487883

In [13]:
print(df.A.iloc[0])

0.49470699134487883

In [11]:
df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon',
...                                'Parrot', 'Parrot'],
...                    'Max Speed' : [380., 370., 24., 26.]})

In [12]:
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [14]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [5]:
x = np.arange(0,5)
x

array([0, 1, 2, 3, 4])

In [10]:
macdKey       = [15]
macdKey.append(30)
macdKey

[15, 30]

NoneType

In [16]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

In [14]:
df['D'].iloc[7] = np.NaN

In [18]:
df.iloc[3:4,[2]] = 1222

In [19]:
df

          A    B       C         D
0  1.357552  1.0    11.0 -1.075093
1 -0.469252  1.0    11.0  0.061514
2 -0.572209  1.0    11.0 -0.664296
3 -0.145550  1.0  1222.0  0.347635
4  1.489273  1.0    11.0 -1.549766
5  0.272189  1.0    11.0 -1.984839
6 -0.906008  1.0    11.0 -1.076363
7 -0.195922  1.0    11.0  0.896631

In [16]:
df.A.loc[df.D.notna()]

0    0.183169
1    0.034536
2   -0.863994
3    1.206515
4    1.018467
5    0.225037
6   -0.117027
Name: A, dtype: float64

In [25]:
df.drop(df[df.D.isna()].index,axis=0)

          A         B         C         D
0  0.183169  0.251445  0.652233  0.842335
1  0.034536  0.589361 -1.137182  0.085072
2 -0.863994 -0.117155  0.709162  0.392567
3  1.206515  0.492979  1.348127  0.514613
4  1.018467  0.448653  0.105540  0.893728
5  0.225037  0.960679  1.650188  0.830468
6 -0.117027 -1.169410 -0.771598 -1.619165

In [27]:
df[df.D.isna()].index.name

In [26]:
d = np.log(23)
print(np.exp(d))

23.0

In [29]:
df.rename(index=str, columns={"A": "fulldate"})

   fulldate    B       C         D
0  1.357552  1.0    11.0 -1.075093
1 -0.469252  1.0    11.0  0.061514
2 -0.572209  1.0    11.0 -0.664296
3 -0.145550  1.0  1222.0  0.347635
4  1.489273  1.0    11.0 -1.549766
5  0.272189  1.0    11.0 -1.984839
6 -0.906008  1.0    11.0 -1.076363
7 -0.195922  1.0    11.0  0.896631

In [30]:
df

          A    B       C         D
0  1.357552  1.0    11.0 -1.075093
1 -0.469252  1.0    11.0  0.061514
2 -0.572209  1.0    11.0 -0.664296
3 -0.145550  1.0  1222.0  0.347635
4  1.489273  1.0    11.0 -1.549766
5  0.272189  1.0    11.0 -1.984839
6 -0.906008  1.0    11.0 -1.076363
7 -0.195922  1.0    11.0  0.896631

In [33]:
df = df.append([df],ignore_index=True)

In [34]:
df

           A    B       C         D
0   1.357552  1.0    11.0 -1.075093
1  -0.469252  1.0    11.0  0.061514
2  -0.572209  1.0    11.0 -0.664296
3  -0.145550  1.0  1222.0  0.347635
4   1.489273  1.0    11.0 -1.549766
5   0.272189  1.0    11.0 -1.984839
6  -0.906008  1.0    11.0 -1.076363
7  -0.195922  1.0    11.0  0.896631
8   1.357552  1.0    11.0 -1.075093
9  -0.469252  1.0    11.0  0.061514
10 -0.572209  1.0    11.0 -0.664296
11 -0.145550  1.0  1222.0  0.347635
12  1.489273  1.0    11.0 -1.549766
13  0.272189  1.0    11.0 -1.984839
14 -0.906008  1.0    11.0 -1.076363
15 -0.195922  1.0    11.0  0.896631

In [35]:
df.replace(11,5)

           A    B       C         D
0   1.357552  1.0     5.0 -1.075093
1  -0.469252  1.0     5.0  0.061514
2  -0.572209  1.0     5.0 -0.664296
3  -0.145550  1.0  1222.0  0.347635
4   1.489273  1.0     5.0 -1.549766
5   0.272189  1.0     5.0 -1.984839
6  -0.906008  1.0     5.0 -1.076363
7  -0.195922  1.0     5.0  0.896631
8   1.357552  1.0     5.0 -1.075093
9  -0.469252  1.0     5.0  0.061514
10 -0.572209  1.0     5.0 -0.664296
11 -0.145550  1.0  1222.0  0.347635
12  1.489273  1.0     5.0 -1.549766
13  0.272189  1.0     5.0 -1.984839
14 -0.906008  1.0     5.0 -1.076363
15 -0.195922  1.0     5.0  0.896631

In [16]:
a = df[5:7].copy()

In [19]:
a.A.iloc[0]= 15

In [22]:
a = df.max(axis=1)

In [23]:
a

0    0.080745
1    0.061135
2    0.318464
3    0.607108
4    1.105612
5    2.187137
6    0.991886
7    2.531728
dtype: float64

In [21]:
df

          A         B         C         D
0  0.080745 -1.084829 -1.016029 -0.819313
1 -0.930544  0.061135 -0.163369 -0.484819
2  0.318464 -1.428123 -0.002303 -0.278420
3  0.607108 -0.893104  0.174577 -1.263302
4 -0.536279  1.105612 -0.683890  0.543252
5  0.457564 -1.044667  2.187137  0.001938
6  0.003767  0.507964  0.636777  0.991886
7 -0.409309 -0.202396 -1.371442  2.531728

In [12]:
mydate = dt.datetime(2019,3,12)

In [13]:
print(mydate.isoweekday())

2

In [24]:
a = [2,3,4]

In [28]:
a.append(4)

In [29]:
a

[2, 3, 4, 3, 4]

In [1]:
import pandas as pd
import numpy as np

np.random.seed(10)
X = pd.DataFrame({
    'x_0': np.random.randint(1, 11, 20),
    'x_1': np.random.randint(1, 11, 20)
})
y = (X['x_0'] + X['x_1']).map(lambda x: 1 if x <= 10 else 0)

In [30]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, shuffle = False, random_state=1)

In [31]:
X_train

    x_0  x_1
0    10    5
1     5    2
2     1    4
3     2    7
4    10    6
5     1    4
6     2   10
7     9    7
8    10   10
9     1    2
10    9   10
11    7    5
12    5    3
13    4    7
14    1    8